<?php

return [
    'store' => 'تم إنشاء المستخدم بنجاح.',
    'update' => 'تم تحديث المستخدم بنجاح.',
    'destroy' => 'تم حذف المستخدم بنجاح.',
    'cant_destroy' => 'لا يمكنك حذف هذا الحساب',
    'cant_block_yourself' => 'لا يمكنك حظر نفسك.',
    'cant_block_superadmin' => 'لا يمكنك حظر المسؤول الرئيسي.',
    
    'roles' => [
        'update' => 'تم تحديث دور المستخم بنجاح.',
        'destroy' => 'تم حذف دور المسخدم بنجاح.',
        'cant_destroy_superadmin' => 'لا يمكنك حذف دور الرئيسي للمسؤول الرئيسي.',
    ],
];
